import Image from "next/image";
import enamd from "@/assets/images/namd/enamad.png";
import khalagh from "@/assets/images/namd/khallagh.png";
import samandehi from "@/assets/images/namd/e.png";
const Social = () => {
  return (
    <div className=" rounded-2xl container mx-auto mb-2">
      <div className=" bg-purple-900 rounded-3xl flex justify-start items-center p-6 my-10 ">
        <h3 className="text-purple-100 ml-10">فرنالند در شبکه های اجتماعی</h3>
        <svg
          className="ml-4 hover:-translate-y-1 ease-in-out duration-200"
          focusable="false"
          aria-hidden="true"
          viewBox="0 0 32 32"
          height="32"
          width="32"
          fill="none"
        >
          <path
            d="M20.9998 2.66675H10.9998C6.39817 2.66675 2.6665 6.39842 2.6665 11.0001V21.0001C2.6665 25.6017 6.39817 29.3334 10.9998 29.3334H20.9998C25.6015 29.3334 29.3332 25.6017 29.3332 21.0001V11.0001C29.3332 6.39842 25.6015 2.66675 20.9998 2.66675ZM26.8332 21.0001C26.8332 24.2167 24.2165 26.8334 20.9998 26.8334H10.9998C7.78317 26.8334 5.1665 24.2167 5.1665 21.0001V11.0001C5.1665 7.78341 7.78317 5.16675 10.9998 5.16675H20.9998C24.2165 5.16675 26.8332 7.78341 26.8332 11.0001V21.0001Z"
            fill="#F5F6F9"
          ></path>
          <path
            d="M15.9997 9.3335C12.318 9.3335 9.33301 12.3185 9.33301 16.0002C9.33301 19.6818 12.318 22.6668 15.9997 22.6668C19.6813 22.6668 22.6663 19.6818 22.6663 16.0002C22.6663 12.3185 19.6813 9.3335 15.9997 9.3335ZM15.9997 20.1668C13.703 20.1668 11.833 18.2968 11.833 16.0002C11.833 13.7018 13.703 11.8335 15.9997 11.8335C18.2963 11.8335 20.1663 13.7018 20.1663 16.0002C20.1663 18.2968 18.2963 20.1668 15.9997 20.1668Z"
            fill="#F5F6F9"
          ></path>
          <path
            d="M23.1667 9.72198C23.6573 9.72198 24.055 9.32426 24.055 8.83365C24.055 8.34303 23.6573 7.94531 23.1667 7.94531C22.676 7.94531 22.2783 8.34303 22.2783 8.83365C22.2783 9.32426 22.676 9.72198 23.1667 9.72198Z"
            fill="#F5F6F9"
          ></path>
        </svg>
        <svg
          className="ml-4 hover:-translate-y-1 ease-in-out duration-200"
          focusable="false"
          aria-hidden="true"
          viewBox="0 0 32 32"
          height="32"
          width="32"
          fill="none"
        >
          <path
            d="M21.152 7.89795C20.1416 7.89778 19.1715 8.28 18.4505 8.96234C17.7295 9.64468 17.3151 10.5726 17.2967 11.5464L17.2595 13.5648C17.2573 13.6732 17.2314 13.7799 17.1834 13.8779C17.1354 13.976 17.0665 14.0631 16.9811 14.1337C16.8958 14.2042 16.7959 14.2566 16.6881 14.2873C16.5802 14.318 16.4669 14.3264 16.3555 14.312L14.2802 14.0403C11.5496 13.6815 8.93335 12.4691 6.42342 10.4533C5.62843 14.6951 7.18119 17.6337 10.9208 19.9007L13.2433 21.3078C13.3537 21.3746 13.4453 21.4665 13.5103 21.5754C13.5753 21.6844 13.6116 21.807 13.6161 21.9325C13.6205 22.0581 13.593 22.1828 13.5359 22.2957C13.4788 22.4087 13.3939 22.5064 13.2885 22.5803L11.1721 24.0708C12.431 24.1464 13.6262 24.0925 14.6179 23.9029C20.8901 22.6957 25.0604 18.1463 25.0604 10.6417C25.0604 10.0291 23.7151 7.89795 21.152 7.89795ZM14.6379 11.499C14.6611 10.2637 15.0618 9.06243 15.7899 8.0456C16.5179 7.02878 17.541 6.2416 18.731 5.78262C19.921 5.32364 21.225 5.21326 22.4797 5.46529C23.7345 5.71733 24.8842 6.32058 25.785 7.19952C26.7302 7.19311 27.5345 7.42378 29.3332 6.37293C28.8878 8.47463 28.6685 9.38707 27.7193 10.6417C27.7193 20.4351 21.475 25.1972 15.139 26.4159C10.7945 27.2515 4.47716 25.879 2.6665 24.0567C3.58912 23.9875 7.33806 23.5992 9.505 22.0703C7.67174 20.9054 0.374598 16.7661 5.16979 5.63734C7.42048 8.17091 9.70308 9.89584 12.0163 10.8108C13.5557 11.4196 13.9333 11.4068 14.6392 11.5003L14.6379 11.499Z"
            fill="#F5F6F9"
          ></path>
        </svg>
        <svg
          className="ml-4 hover:-translate-y-1 ease-in-out duration-200"
          focusable="false"
          aria-hidden="true"
          viewBox="0 0 32 32"
          height="32"
          width="32"
          fill="none"
        >
          <path
            d="M28.4431 4.56562C28.098 4.28273 27.6814 4.09735 27.2379 4.0292C26.7943 3.96106 26.3403 4.0127 25.9241 4.17863L4.20043 12.8202C3.73598 13.0086 3.34064 13.3316 3.06684 13.7465C2.79305 14.1614 2.65375 14.6485 2.66742 15.1432C2.6811 15.6379 2.8471 16.1168 3.14341 16.5164C3.43973 16.9159 3.85233 17.2173 4.3265 17.3805L8.7207 18.8866L11.1693 26.8677C11.2029 26.9742 11.2514 27.0755 11.3136 27.1687C11.3233 27.183 11.3366 27.1926 11.3463 27.2081C11.4177 27.3061 11.504 27.3927 11.6021 27.4649C11.6295 27.486 11.6578 27.506 11.6869 27.5246C11.8018 27.5997 11.9289 27.6547 12.0627 27.6871L12.0785 27.6883L12.0857 27.6918C12.1668 27.7079 12.2492 27.7159 12.3318 27.7157L12.3536 27.7121C12.4778 27.7101 12.6009 27.6892 12.7185 27.65C12.7464 27.6405 12.7694 27.6261 12.7961 27.6142C12.8841 27.5786 12.9675 27.5329 13.0446 27.478C13.106 27.4267 13.1674 27.3753 13.2288 27.324L16.5042 23.761L21.3893 27.49C21.8193 27.82 22.3486 27.9994 22.8937 28C23.4649 27.9993 24.0185 27.8052 24.4617 27.45C24.9049 27.0949 25.2107 26.6004 25.3277 26.0495L29.2831 6.91862C29.3726 6.48822 29.3417 6.04196 29.1937 5.62752C29.0458 5.21308 28.7863 4.84604 28.4431 4.56562ZM12.8119 19.2665C12.644 19.4315 12.5293 19.6418 12.4821 19.8708L12.1064 21.6672L11.156 18.5701L16.0836 16.0415L12.8119 19.2665ZM22.8755 25.6016L17.1018 21.1942C16.8602 21.0105 16.5573 20.9233 16.2533 20.9499C15.9493 20.9764 15.6667 21.1148 15.4617 21.3376L14.4119 22.4782L14.7829 20.7021L23.3688 12.2421C23.5726 12.0402 23.6963 11.7731 23.7179 11.4892C23.7394 11.2052 23.6573 10.923 23.4864 10.6935C23.3154 10.4639 23.0668 10.3021 22.7854 10.2372C22.5041 10.1722 22.2084 10.2085 21.9518 10.3394L9.62984 16.6602L5.11443 15.0323L26.9084 6.44324L22.8755 25.6016Z"
            fill="#F5F6F9"
          ></path>
        </svg>
        <svg
          className="ml-4 hover:-translate-y-1 ease-in-out duration-200"
          focusable="false"
          aria-hidden="true"
          viewBox="0 0 32 32"
          height="32"
          width="32"
          fill="none"
        >
          <path
            d="M5.69681 2.66675C4.89489 2.67246 4.12743 2.99356 3.56037 3.56062C2.99331 4.12767 2.67222 4.89513 2.6665 5.69705V26.3031C2.6665 27.9601 4.03984 29.3334 5.69681 29.3334H26.3029C27.9598 29.3334 29.3332 27.9601 29.3332 26.3031V5.69705C29.3332 4.04008 27.9598 2.66675 26.3029 2.66675H5.69681ZM5.69681 5.09099H26.3029C26.6483 5.09099 26.9089 5.3516 26.9089 5.69705V26.3031C26.9089 26.6486 26.6483 26.9092 26.3029 26.9092H5.69681C5.61672 26.911 5.53709 26.8966 5.46274 26.8668C5.38838 26.8369 5.32084 26.7924 5.2642 26.7357C5.20755 26.6791 5.16298 26.6115 5.13317 26.5372C5.10335 26.4628 5.08892 26.3832 5.09075 26.3031V5.69705C5.09075 5.3516 5.35135 5.09099 5.69681 5.09099ZM9.25802 7.17463C8.98024 7.16793 8.70393 7.21685 8.44535 7.31852C8.18676 7.42019 7.95112 7.57255 7.75229 7.76664C7.55346 7.96073 7.39546 8.19263 7.28758 8.44869C7.1797 8.70475 7.12413 8.9798 7.12413 9.25766C7.12413 9.53551 7.1797 9.81056 7.28758 10.0666C7.39546 10.3227 7.55346 10.5546 7.75229 10.7487C7.95112 10.9428 8.18676 11.0951 8.44535 11.1968C8.70393 11.2985 8.98024 11.3474 9.25802 11.3407C9.80177 11.3276 10.3188 11.1024 10.6988 10.7131C11.0787 10.3239 11.2914 9.80157 11.2914 9.25766C11.2914 8.71375 11.0787 8.19139 10.6988 7.80218C10.3188 7.41296 9.80177 7.18774 9.25802 7.17463ZM20.2035 12.7043C18.4665 12.7043 17.3114 13.6558 16.8338 14.5601H16.7574V12.9698H13.3477V24.4849H16.9089V18.8025C16.9089 17.3019 17.2071 15.8486 19.0677 15.8486C20.9004 15.8486 20.9247 17.5431 20.9247 18.8789V24.4849H24.4847V18.1589C24.4847 15.0631 23.8265 12.7043 20.2047 12.7043H20.2035ZM7.51499 12.9698V24.4849H11.1138V12.9698H7.51499Z"
            fill="#F5F6F9"
          ></path>
        </svg>
      </div>
      <div className="flex flex-col md:flex-row sm:flex-row">
        <div className="flex flex-1">
          <ul className="flex flex-1 flex-col">
            <span className="text-xl text-purple-900 font-bold ">
              راهنمای مشتریان
            </span>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">آموزش تصویری دریافت وام</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">راهنما</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">مدارک لازم</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">محاسبه اقساط</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">راهنمای امضای الکترونیکی</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#"> ثبت‌نام حضوری</a>
            </li>
          </ul>
          <ul className="flex flex-1 flex-col">
            <span className="text-xl text-purple-900 font-bold">فرنالند</span>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">درباره ما </a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">تماس با ما</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">مزایای شغلی ما </a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#"> بلاگ</a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#">داستان ما </a>
            </li>
            <li className="text-sm text-purple-950 m-2 hover:-translate-x-1 ease-in-out duration-200">
              <a href="#"> فروشگاه فرنا</a>
            </li>
          </ul>
        </div>
        <div>
          <div className="flex flex-row justify-center md:mt-6 sm:mt-6">
            <Image
              src={enamd}
              alt="enamd"
              className="w-auto h-20 ml-10 md:mt-5"
            />
            <Image
              src={khalagh}
              alt="enamd"
              className="w-auto h-20 ml-10 md:mt-5"
            />
            <Image
              src={samandehi}
              alt="enamd"
              className="w-auto h-20 ml-10 md:mt-5"
            />
          </div>
          <div className="flex justify-center flex-col mt-6 mb-4">
            <div className="flex justify-start flex-row mt-2 mb-2">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth="1.5"
                stroke="currentColor"
                className="w-6 h-6 ml-2 "
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="M15 10.5a3 3 0 1 1-6 0 3 3 0 0 1 6 0Z"
                />
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="M19.5 10.5c0 7.142-7.5 11.25-7.5 11.25S4.5 17.642 4.5 10.5a7.5 7.5 0 1 1 15 0Z"
                />
              </svg>

              <span className="text-purple-950 text-base">
                آدرس فرنا: تهران، میدان فردوسی، مجتمع مرکز تجارت جهانی فردوسی
              </span>
            </div>
            <div className="flex justify-start flex-row mt-2 mb-2">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth="1.5"
                stroke="currentColor"
                className="w-6 h-6 ml-2 "
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="M2.25 6.75c0 8.284 6.716 15 15 15h2.25a2.25 2.25 0 0 0 2.25-2.25v-1.372c0-.516-.351-.966-.852-1.091l-4.423-1.106c-.44-.11-.902.055-1.173.417l-.97 1.293c-.282.376-.769.542-1.21.38a12.035 12.035 0 0 1-7.143-7.143c-.162-.441.004-.928.38-1.21l1.293-.97c.363-.271.527-.734.417-1.173L6.963 3.102a1.125 1.125 0 0 0-1.091-.852H4.5A2.25 2.25 0 0 0 2.25 4.5v2.25Z"
                />
              </svg>
              <span className="text-purple-950 text-base">
                شماره تماس:1145684102
              </span>
            </div>
            <div className="flex justify-start flex-row mt-2 mb-2">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth="1.5"
                stroke="currentColor"
                className="w-6 h-6 ml-2 "
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="M7.5 8.25h9m-9 3H12m-9.75 1.51c0 1.6 1.123 2.994 2.707 3.227 1.129.166 2.27.293 3.423.379.35.026.67.21.865.501L12 21l2.755-4.133a1.14 1.14 0 0 1 .865-.501 48.172 48.172 0 0 0 3.423-.379c1.584-.233 2.707-1.626 2.707-3.228V6.741c0-1.602-1.123-2.995-2.707-3.228A48.394 48.394 0 0 0 12 3c-2.392 0-4.744.175-7.043.513C3.373 3.746 2.25 5.14 2.25 6.741v6.018Z"
                />
              </svg>
              <span className="text-purple-950 text-base">
                کد پستی:1145684102
              </span>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Social;
